***** Desugar Method Calls

- [[https://doc.rust-lang.org/stable/reference/expressions/method-call-expr.html][Method-call expressions]] (also [[https://doc.rust-lang.org/stable/reference/expressions/call-expr.html][Call expressions]])
- [[https://doc.rust-lang.org/stable/reference/expressions/operator-expr.html#the-dereference-operator][The dereference operator]] (in [[https://doc.rust-lang.org/stable/reference/expressions/operator-expr.html][Operator expressions]])
- [[https://doc.rust-lang.org/stable/reference/type-coercions.html#unsized-coercions][Unsized Coercions]] (in [[https://doc.rust-lang.org/stable/reference/type-coercions.html][Type coercions]])
- [[https://doc.rust-lang.org/stable/reference/paths.html#qualified-paths][Qualified paths]] (in [[https://doc.rust-lang.org/stable/reference/paths.html][Paths]])

"Method calls are resolved to associated [[https://doc.rust-lang.org/stable/reference/items/associated-items.html#methods][methods]] on specific traits,
either statically dispatching to a method if the exact ~self~-type of
the left-hand-side is known, or dynamically dispatching if the
left-hand-side expression is an indirect [[https://doc.rust-lang.org/stable/reference/types/trait-object.html][trait object]]. 

...

When looking up a method call, the receiver may be automatically
dereferenced or borrowed in order to call a method. This requires a
more complex lookup process than for other functions, since there may
be a number of possible methods to call. The following procedure is
used: 

The first step is to build a list of candidate receiver types. Obtain
these by repeatedly [[https://doc.rust-lang.org/stable/reference/expressions/operator-expr.html#the-dereference-operator][dereferencing]] the receiver expression's type,
adding each type encountered to the list, then finally attempting an
[[https://doc.rust-lang.org/stable/reference/type-coercions.html#unsized-coercions][unsized coercion]] at the end, and adding the result type if that is
successful. Then, for each candidate ~T~, add ~& T~ and ~&mut T~ to
the list immediately after ~T~."

An example list of candidate types when a receiver is of type ~Box<[i32;2]>~:
- ~Box<[i32; 2]>~
  - ~&Box<[i32; 2]>~
  - ~&mut Box<[i32; 2]>~
- ~[i32; 2]~ (by dereferencing)
  - ~&[i32; 2]~
  - ~&mut [i32; 2]~
- ~[i32]~ (by unsized coercion)
  - ~&[i32]~
  - ~&mut [i32]~

"Then, for each candidate type ~T~, search for a [[https://doc.rust-lang.org/stable/reference/visibility-and-privacy.html][visible]] method with a
receiver of that type in the following places: 
1. ~T~'s inherent methods (methods implemented directly on ~T~).
2. Any of the methods provided by a [[https://doc.rust-lang.org/stable/reference/visibility-and-privacy.html][visible]] trait implemented by ~T~.
   If ~T~ is a type parameter, methods provided by trait bounds on ~T~
   are looked up first. Then all remaining methods in scope are looked
   up.

Note: the lookup is done for each type in order, which can
occasionally lead to surprising results. The below code will print "In
trait impl!", because ~& self~ methods are looked up first, the trait
method is found before the struct's ~&mut self~ method is found."

#+BEGIN_SRC rust
  struct Foo {}

  trait Bar { fn bar(& self); }

  impl Foo { fn bar(&mut self) { println!("In struct impl!") } }

  impl Bar for Foo { fn bar(& self) { println!("In trait impl!") } }

  let f: Foo = Foo{};
  f.bar();
#+END_SRC

#+RESULTS:
: In trait impl!

"If this results in multiple possible candidates, then it is an error,
and the receiver must be [[https://doc.rust-lang.org/stable/reference/expressions/call-expr.html#disambiguating-function-calls][converted]] to an appropriate receiver type to
make the method call. 

This process does not take into account the mutability or lifetime of
the receiver, or whether a method is unsafe. Once a method is looked
up, if it can't be called for one (or more) of those reasons, the
result is a compiler error. 

If a step is reached where there is more than one possible method,
such as where generic methods or traits are considered the same, then
it is a compiler error. These cases require a disambiguating function
call syntax for method and function invocation." 

[TILO-NOTE] Sieht so aus als ob ich über den Link oben "converted"
([[https://doc.rust-lang.org/stable/reference/expressions/call-expr.html#disambiguating-function-calls][Disambiguating Function Calls]]) auf diese seltsame Notation gestoßen
bin, die mir ~cargo +nightly rustc -- -Z unpretty=hir,typed~ ausgibt.
Dabei musste ich feststellen, dass diese Ausgabe ~typed~ nicht
kompilierbar ist. Hier wird die [[https://doc.rust-lang.org/stable/reference/paths.html#qualified-paths][fully-qualified path syntax]] mit der
Notation "~<~ Type (~as~ TypePath)? ~>~" verwendet. 

#+BEGIN_SRC rust
  struct S;
  impl S { fn f() { println!("S"); } }

  trait T1 { fn f() { println!("T1 f"); } }
  impl T1 for S {}

  trait T2 { fn f() { println!("T2 f"); } }
  impl T2 for S {}

  S::f();  // Calls the inherent impl.
  <S as T1>::f();  // Calls the T1 trait function.
  <S as T2>::f();  // Calls the T2 trait function.
#+END_SRC

#+RESULTS:
: S
: T1 f
: T2 f

"Rust treats all function calls as sugar for a more explicit,
[[https://doc.rust-lang.org/stable/reference/paths.html#qualified-paths][fully-qualified]] syntax. Upon compilation, Rust will desugar all
function calls into the explicit form. Rust may sometimes require you
to qualify function calls with trait, depending on the ambiguity of a
call in light of in-scope items.

...

Several situations often occur which result in ambiguities about the
receiver or referent of method or associated function calls. These
situations may include: 
- Multiple in-scope traits define methods with the same name for the
  same types 
- Auto-~deref~ is undesirable; for example, distinguishing between
  methods on a smart pointer itself and the pointer's referent 
- Methods which take no arguments, like [[https://doc.rust-lang.org/stable/std/default/trait.Default.html#tymethod.default][default()]], and return
  properties of a type, like [[https://doc.rust-lang.org/stable/std/mem/fn.size_of.html][size_of()]] 

To resolve the ambiguity, the programmer may refer to their desired
method or function using more specific paths, types, or traits."

For example,
#+BEGIN_SRC rust
  trait Pretty { fn print(& self); }
  trait Ugly   { fn print(& self); }
  struct Foo; 
  struct Bar; 

  impl Pretty for Foo { fn print(& self) { println!("Pretty for Foo") } }

  impl Pretty for Bar { fn print(& self) { println!("Pretty for Bar") } }
  impl Ugly   for Bar { fn print(& self) { println!("Ugly for Bar") } }

  let f = Foo;
  let b = Bar;

  // we can do this because we only have one item called `print` for `Foo`s
  f.print();
  // more explicit, and, in the case of `Foo`, not necessary
  Foo::print(&f);
  // if you're not into the whole brevity thing
  <Foo as Pretty>::print(&f);

  // b.print(); // Error: multiple 'print' found
  // Bar::print(&b); // Still an error: multiple `print` found

  // necessary because of in-scope items defining `print`
  <Bar as Pretty>::print(&b);
#+END_SRC

#+RESULTS:
: Pretty for Foo
: Pretty for Foo
: Pretty for Foo
: Pretty for Bar

Refer to [[https://github.com/rust-lang/rfcs/blob/master/text/0132-ufcs.md][RFC 132]] for further details and motivations."


